<template>
  <div class="agreement-wrapper">
    <div class="agreement_content">
      <h3 class="title">
        <img src="@/assets/picture/agreement.png" alt />
      </h3>
      <section class="article">
        <h4>1. 重要须知</h4>
        <p>
          1.1、本用户使用许可协议（下称“协议”或“本协议”）是用户与球虎直播科技有限公司（即“球虎直播”视频直播平台，下称“球虎直播”）之间关于注册、登录“球虎直播”视频直播平台（下称“视频直播平台”或“平台”）以及使用平台服务所订立的协议，本协议约定了球虎直播与用户之间关于“球虎直播”服务方面的权利义务。
          “用户”是指注册、登录、使用、浏览、获取本协议项下服务的个人或组织。
        </p>
        <p>
          1.2、用户应认真阅读（未成年人应当在监护人陪同下阅读）、充分理解本协议中各条款，特别是免除或者限制球虎直播责任的免责条款及对用户的权利限制条款，并选择接受或不接受本协议。除非用户接受本协议所有条款，否则用户无权注册、登录或使用球虎直播为用户提供的服务。用户的注册、登录、使用等行为将视为对本协议的接受，并同意接受本协议各项条款的约束。
        </p>
        <p>
          1.3、通过访问和/或使用球虎直播，用户表示同意接受本协议的所有条件和条款。球虎直播是面向最终用户提供播客实时在线演绎、互动直播等服务的网站。如果用户不愿接受本协议的全部条件和条款，请用户不要访问或使用球虎直播。如果用户愿意接受本协议，则意味着用户了解及完全同意本协议的各项内容，以及球虎直播对本协议及本协议附件随时所做的任何修改。
        </p>
        <p>
          1.4、本协议下的条款可由球虎直播随时变更，用户须定期审阅本协议。协议条款一旦发生变动，球虎直播将会在网站相关的页面上发布。变更后的协议在相关的页面上公布即有效代替原来的协议，恕不再另行通知。用户如不同意球虎直播对本协议的所作的任何变更，应立即停止使用球虎直播提供的服务。如用户在本协议变更后继续使用球虎直播的服务，即视作用户已完全同意变更后的协议。
        </p>
        <p>
          1.5、请注意：鉴于用户使用网络服务之习惯，用户有权利且有义务自使用球虎直播服务之日起每月自行主动对本协议之全部内容进行重新阅读，鉴于上述约定，用户因自身怠于行使该等权利或怠于履行该等义务的，无权以未获知上述内容而对相关条款的法律效力提出异议。
        </p>
      </section>
      <section class="article">
        <h4>2. 服务内容</h4>
        <p>
          1.1、本用户使用许可协议（下称“协议”或“本协议”）是用户与球虎直播科技有限公司（即“球虎直播”视频直播平台，下称“球虎直播”）之间关于注册、登录“球虎直播”视频直播平台（下称“视频直播平台”或“平台”）以及使用平台服务所订立的协议，本协议约定了球虎直播与用户之间关于“球虎直播”服务方面的权利义务。
          “用户”是指注册、登录、使用、浏览、获取本协议项下服务的个人或组织。
        </p>
        <p>
          1.2、用户应认真阅读（未成年人应当在监护人陪同下阅读）、充分理解本协议中各条款，特别是免除或者限制球虎直播责任的免责条款及对用户的权利限制条款，并选择接受或不接受本协议。除非用户接受本协议所有条款，否则用户无权注册、登录或使用球虎直播为用户提供的服务。用户的注册、登录、使用等行为将视为对本协议的接受，并同意接受本协议各项条款的约束。
        </p>
        <p>
          1.3、通过访问和/或使用球虎直播，用户表示同意接受本协议的所有条件和条款。球虎直播是面向最终用户提供播客实时在线演绎、互动直播等服务的网站。如果用户不愿接受本协议的全部条件和条款，请用户不要访问或使用球虎直播。如果用户愿意接受本协议，则意味着用户了解及完全同意本协议的各项内容，以及球虎直播对本协议及本协议附件随时所做的任何修改。
        </p>
        <p>
          1.4、本协议下的条款可由球虎直播随时变更，用户须定期审阅本协议。协议条款一旦发生变动，球虎直播将会在网站相关的页面上发布。变更后的协议在相关的页面上公布即有效代替原来的协议，恕不再另行通知。用户如不同意球虎直播对本协议的所作的任何变更，应立即停止使用球虎直播提供的服务。如用户在本协议变更后继续使用球虎直播的服务，即视作用户已完全同意变更后的协议。
        </p>
        <p>
          1.5、请注意：鉴于用户使用网络服务之习惯，用户有权利且有义务自使用球虎直播服务之日起每月自行主动对本协议之全部内容进行重新阅读，鉴于上述约定，用户因自身怠于行使该等权利或怠于履行该等义务的，无权以未获知上述内容而对相关条款的法律效力提出异议。
        </p>
      </section>
    </div>
  </div>
</template>

<script>
export default {
  name: "agreement",
  data() {
    return {};
  },
};
</script>

<style scoped>
@import "../style/common.css";
@import "../style/agreement.css";
</style>